{
  "auto_map": {
    "AutoModelForCausalLM": "modeling_dense_gau_retnet.LlamaForCausalLM",
    "AutoModelForSequenceClassification": "modeling_dense_gau_retnet.LlamaForSequenceClassification"
  },
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 2560,
  "query_key_dim": 1280,
  "initializer_range": 0.02,
  "max_position_embeddings": 2048,
  "model_type": "llama",
  "num_attention_heads": 4,
  "num_hidden_layers": 25,
  "pad_token_id": 0,
  "rms_norm_eps": 1e-06,
  "layernorm_eps": 1e-5,
  "retnorm": false,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.29.1",
  "use_cache": false,
  "vocab_size": 32000,
  "v_factor": 2,
  "dense_block_layers": 1,
  "dropout": 0.1,
  "deepnorm": false
  }
